<a href="https://colab.research.google.com/github/cagBRT/Intro-to-Programming-with-Python/blob/master/SideTable.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

This notebook demonstrates some of the uses of Sidetable, a Python library.
https://pbpython.com/sidetable.html

In [1]:
# Clone the entire repo.
!git clone -l -s https://github.com/cagBRT/Intro-to-Programming-with-Python.git cloned-repo
%cd cloned-repo
!ls

Cloning into 'cloned-repo'...
warning: --local is ignored
remote: Enumerating objects: 691, done.
remote: Total 691 (delta 0), reused 0 (delta 0), pack-reused 691
Receiving objects: 100% (691/691), 12.16 MiB | 13.92 MiB/s, done.
Resolving deltas: 100% (377/377), done.
/content/cloned-repo
C10_Intro_to_Python.ipynb      C6_Intro_to_Python.ipynb
C_11_Intro_to_Python.ipynb     C7_1_Intro_to_Python.ipynb
c1-content		       C7_2_Intro_to_Python.ipynb
C1_Intro_to_Python.ipynb       c7-content
c2-content		       c8-content
C2_IntroToMLProgramming.ipynb  C8_Intro_to_Python.ipynb
c3-content		       C9_Intro_to_Python.ipynb
C3_Intro_To_Python.ipynb       data_files
c4-content		       Hitters.csv
C4_Intro_to_Python.ipynb       README.md
c5-content		       SideTable.ipynb
C5_Intro_to_Python.ipynb       stinkbug.png
C6_2_Intro_to_Python.ipynb     USA_cars_datasets.csv
c6-content

**Install sidetable**

In [2]:
!pip install sidetable

Collecting sidetable
  Downloading https://files.pythonhosted.org/packages/45/cf/d9d6ea5785788b0e748336657f60d0e73e372b4b4f25e461f0096d11b850/sidetable-0.3.0.tar.gz
Requirement already satisfied: pandas>=1.0 in /usr/local/lib/python3.6/dist-packages (from sidetable) (1.0.4)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas>=1.0->sidetable) (2018.9)
Requirement already satisfied: numpy>=1.13.3 in /usr/local/lib/python3.6/dist-packages (from pandas>=1.0->sidetable) (1.18.5)
Requirement already satisfied: python-dateutil>=2.6.1 in /usr/local/lib/python3.6/dist-packages (from pandas>=1.0->sidetable) (2.8.1)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.6.1->pandas>=1.0->sidetable) (1.12.0)
Building wheels for collected packages: sidetable
  Building wheel for sidetable (setup.py) ... done
  Created wheel for sidetable: filename=sidetable-0.3.0-cp36-none-any.whl size=9391 sha256=9353299debc97f8b78f813d075631d47c92f86b282713a03784918219aaff462
  Stored in directory: /root/.cache/pip/wheels/cb/89/c8/8523a369438a97da6e37ade1cf5bb7ba6f7638a42ebc22594c
Successfully built sidetable
Installing collected packages: sidetable
Successfully installed sidetable-0.3.0

In [0]:
import pandas as pd
import sidetable

**Get data**
<br>Load the data as a pandas dataframe

In [4]:
df = pd.read_csv("USA_cars_datasets.csv")
df.head()

   Unnamed: 0  price      brand  ...       state  country      condition
0           0   6300     toyota  ...  new jersey      usa   10 days left
1           1   2899       ford  ...   tennessee      usa    6 days left
2           2   5350      dodge  ...     georgia      usa    2 days left
3           3  25000       ford  ...    virginia      usa  22 hours left
4           4  27700  chevrolet  ...     florida      usa  22 hours left

[5 rows x 13 columns]

Assignment 1<br>
Load the dataset phoenix_uber_trips.csv into a Pandas dataframe

In [5]:
df_hitter = pd.read_csv("Hitters.csv")
df_hitter.head()

   AtBat  Hits  HmRun  Runs  RBI  ...  PutOuts  Assists  Errors  Salary  NewLeague
0    293    66      1    30   29  ...      446       33      20     NaN          A
1    315    81      7    24   38  ...      632       43      10   475.0          N
2    479   130     18    66   72  ...      880       82      14   480.0          A
3    496   141     20    65   78  ...      200       11       3   500.0          N
4    321    87     10    39   42  ...      805       40       4    91.5          N

[5 rows x 20 columns]

**Assignment 2**<br>
How many rows are in the Uber Hitters dataset?

In [7]:
df_hitter.shape

(322, 20)

Use sidetable to determine the top 10 most frequently listed brands

In [8]:
df.stb.freq(['brand'])[:10]

       brand  Count   Percent  Cumulative Count  Cumulative Percent
0       ford   1235  0.494198              1235            0.494198
1      dodge    432  0.172869              1667            0.667067
2     nissan    312  0.124850              1979            0.791917
3  chevrolet    297  0.118848              2276            0.910764
4        gmc     42  0.016807              2318            0.927571
5       jeep     30  0.012005              2348            0.939576
6   chrysler     18  0.007203              2366            0.946779
7        bmw     17  0.006803              2383            0.953581
8    hyundai     15  0.006002              2398            0.959584
9        kia     13  0.005202              2411            0.964786

**Assignment 3**

Use sidetable to how many players have hit 4 homeruns

In [10]:
df_hitter.stb.freq(['Salary'])[:10]

   Salary  Count   Percent  Cumulative Count  Cumulative Percent
0   750.0      8  0.030418                 8            0.030418
1   250.0      6  0.022814                14            0.053232
2   100.0      6  0.022814                20            0.076046
3    90.0      6  0.022814                26            0.098859
4   700.0      5  0.019011                31            0.117871
5   450.0      5  0.019011                36            0.136882
6   300.0      5  0.019011                41            0.155894
7    75.0      5  0.019011                46            0.174905
8    70.0      5  0.019011                51            0.193916
9   875.0      4  0.015209                55            0.209125

Use sidetable to determine top three brands vs other brands

In [39]:
df.stb.freq(['brand'], thresh=.8, other_label='other brands')

          brand  Count   Percent  Cumulative Count  Cumulative Percent
0          ford   1235  0.494198              1235            0.494198
1         dodge    432  0.172869              1667            0.667067
2        nissan    312  0.124850              1979            0.791917
3  other brands    520  0.208083              2499            1.000000

In [0]:
df.stb.freq(['brand','year'], thresh=.5)

In [0]:
df[df.brand == 'ford'].stb.freq(['year'], thresh=.9)

In [0]:
df.stb.freq(['brand'], value='price', thresh=.95)

In [0]:
df.stb.freq(['brand'], value='price', thresh=.95, style=True)